app/controllers/answers_controller.rb

	def index
    @user = current_user
    @student = Student.find_by_admission_no(@user.username)
    @batch =@student.batch_id
    @exam = ExamGroup.find(:all, :conditions => ['exam_date <= ? && batch_id =?' , Date.today, @batch])
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1
SELECT * FROM `exam_groups` WHERE (exam_date <= '2014-03-15' && batch_id =1)

  def exam
    @exam_group = ExamGroup.find(params[:exam_group_id])
    mod = @exam_group.modules.split(',')
    @modules = StudentAdditionalField.find(:all, :conditions => ['id in (?)',mod])
---
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (id in ('1'))

  def answer
    @user = current_user
    @student = Student.find_by_admission_no(@user.username)
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @answer = Answer.new
    mod = @exam_group.modules.split(',')
    @modules = StudentAdditionalField.find(:all, :conditions => ['id in (?)',mod])
    session[:mod] = []
    @modules.each do |m|
      session[:mod].push m
    end
    @module = session[:mod].first
    @questions = Question.find(:all, :conditions => ['exam_group_id=? && student_additional_field_id=?',@exam_group,@module])
    @fin = Answer.find_by_id(1, :conditions => ['user_id=?',@user])
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (id in ('1'))
SELECT * FROM `questions` WHERE (exam_group_id=1 && student_additional_field_id=1)
SELECT * FROM `answers` WHERE (user_id=3) AND (`answers`.`id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def start
    @user = current_user
    @student = Student.find_by_admission_no(@user.username)
    @exam_group = ExamGroup.find_by_id(params[:exam_group_id])
    @answer = Answer.new(params[:ans])
    @module = params[:student_additional_field]
    @ques = Question.find(:all, :conditions => ['exam_group_id=? && student_additional_field_id=?',@exam_group,@module])
    mcq = []
    comp = []
    @ques.each do |q|
      if q.is_pass == 'comp'
        comp.push q.id unless q.id.nil?
      else
        mcq.push q.id unless q.id.nil?
      end
    end
    @questions = mcq.shuffle.concat(comp)
    session[:ques] = @questions
    a = session[:ques].first
    @slno = 1
    @fin = Answer.find_by_questions_id(a, :conditions => ['user_id=?',@user])
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = '1') LIMIT 1
SELECT * FROM `questions` WHERE (exam_group_id=1 && student_additional_field_id='1')
SELECT * FROM `answers` WHERE (user_id=3) AND (`answers`.`questions_id` = 28) LIMIT 1

  def next
    @user = current_user
    @student = Student.find_by_admission_no(@user.username)
    @exam_group = ExamGroup.find_by_id(params[:exam_group_id])
    @answer = Answer.new(params[:ans])
    @answer.answer = params[:answer]
    unless params[:answer].nil?
      @answer.visited = 1
    else
      @answer.visited = 0
    end
    @answer.exam_group_id = @exam_group.id
    @answer.user_id = @user.id
    passed_question = params[:passed_question]
    @answer.questions_id = passed_question
    @question = Question.find_by_id(passed_question)
    @module = Question.find_by_sql ["SELECT student_additional_field_id FROM questions WHERE id=#{passed_question}"]
    student_additional_field_id = @module[0].student_additional_field_id
    b = params[:s].to_i - 1
    c = params[:s].to_i
    @questions = session[:ques]
    a = @questions[b]
    d = @questions[c]
    @answer.modules_id = student_additional_field_id
      if params[:answer] == @question.is_answer
        @answer.marks = 1
      else
        @answer.marks = 0
      end

    if @answer.save
      last = @questions.last + 1
      @ans = Question.find_by_id(a)
      @fin = Answer.find_by_questions_id(a, :conditions => ['user_id=?',@user])
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = '1') LIMIT 1
SELECT * FROM `questions` WHERE (`questions`.`id` = '34') LIMIT 1
INSERT INTO `answers` (`modules_id`, `visited`, `questions_id`, `user_id`, `exam_group_id`, `answer`, `marks`) VALUES(1, 1, 34, 3, 1, 'ans1', 0)
SELECT * FROM `answers` WHERE (user_id=3) AND (`answers`.`questions_id` = 38) LIMIT 1

  def update
    @user = current_user
    @student = Student.find_by_admission_no(@user.username)
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @answer = Answer.find_by_questions_id(params[:passed_question], :conditions => ['user_id=?',@user])
    @answer.answer = params[:answer]
    unless params[:answer].nil?
      @answer.visited = 1
    else
      @answer.visited = 0
    end
    @answer.exam_group_id = @exam_group.id
    @answer.user_id = @user.id
    passed_question = params[:passed_question]
    @answer.questions_id = passed_question
    @question = Question.find_by_id(passed_question)
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `answers` WHERE (user_id=3) AND (`answers`.`questions_id` = '28') LIMIT 1
SELECT * FROM `questions` WHERE (id not in (31)) AND (`questions`.`id` = 20) LIMIT 1