app/controllers/exam_groups_controller.rb

  def index
    @sms_setting = SmsSetting.new
    @batch = Batch.find_by_id(params[:batch_id])
    @exam_groups = @batch.exam_groups
    if @current_user.employee?
      @user_privileges = @current_user.privileges
      @employee_subjects= @current_user.employee_record.subjects.map { |n| n.id}
---
SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )

  def show
    @exam_group = ExamGroup.find_by_id(params[:id])
    mod = @exam_group.modules.split(',')
    @modules = StudentAdditionalField.find(:all, :conditions => ['id in (?)',mod])
    @batch = Batch.find_by_id(params[:batch_id])
    if @current_user.employee?
      @user_privileges = @current_user.privileges
      @employee_subjects= @current_user.employee_record.subjects.map { |n| n.id}
---
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = '1') LIMIT 1
SELECT * FROM `student_additional_fields` WHERE (id in ('1'))
SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )