app/controllers/questions_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (`student_additional_fields`.`id` = 1)
SELECT * FROM `questions` WHERE (exam_group_id=1 && student_additional_field_id=1) ORDER BY student_additional_field_id asc
---
  def index
   @batch = Batch.find(params[:batch_id])
   @exam_group = ExamGroup.find(params[:exam_group_id])
   @module = StudentAdditionalField.find(params[:module_id])
   @questions = Question.find(:all, :conditions=>['exam_group_id=? && student_additional_field_id=?', @exam_group, @module ], :order => 'student_additional_field_id asc')

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (`student_additional_fields`.`id` = 1)
SELECT * FROM `questions` ORDER BY questions.id DESC LIMIT 1
SELECT * FROM `questions` WHERE (exam_group_id=1 && student_additional_field_id=1)
---
  def new
    @question = Question.new
    @batch = Batch.find(params[:batch_id])
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @module = StudentAdditionalField.find(params[:module_id])
    @ques = Question.last
    @questions = Question.find(:all, :conditions => ['exam_group_id=? && student_additional_field_id=?',@exam_group,@module])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1) LIMIT 1
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (`student_additional_fields`.`id` = 1)
---
  def edit
    @quest = Question.find(params[:id])
    @question = Question.find(params[:id])
    @batch = Batch.find(params[:batch_id])
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @question.is_answer = params[:is_answer]
    @question.is_pass = params[:is_pass].to_s
    @fin = Question.find_by_id(@question)
    @module = StudentAdditionalField.find(params[:module_id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (`student_additional_fields`.`id` = 1)
UPDATE `questions` SET `ques` = 'One day when Kranti was walking on the street, one boy requested him to donate for cancer patient&rsquo;s welfare fund.&nbsp; He gave him a rupee more than half the money he had. He walked a few more steps. Then came a girl who requested him to donate for poor people\'s fund for which he gave two rupees more than half the money he had then.&nbsp; After that, again a boy approached him for an orphanage fund. He gave three rupees more than half of what he had.&nbsp; At last he had just one rupee remaining in his hand. How much amount did Ram have in his pocket when he started?2222222' WHERE `id` = 1
---
  def update
    @question = Question.find(params[:id])
    @batch = Batch.find(params[:batch_id])
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @module = StudentAdditionalField.find(params[:module_id])
    @question.is_pass = params[:is_pass].to_s
    @question.is_answer = params[:is_answer].to_s
    if @question.update_attributes(params[:question])

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (`student_additional_fields`.`id` = '1') LIMIT 1
INSERT INTO `questions` (`ques`, `ans1`, `ans2`, `passage`, `ans3`, `student_additional_field_id`, `exam_group_id`, `ans4`, `is_answer`, `is_pass`) VALUES('2222222', 'sa', 'd', '', 'a', 1, 1, 'f', 'ans1', '')
---
  def create
    @batch = Batch.find(params[:batch_id])
    @exam_group = ExamGroup.find(params[:exam_group_id])
    @module = StudentAdditionalField.find_by_id(params[:module_id])
    @question = Question.new(params[:question])
    @question.is_answer = params[:is_answer]
    @question.student_additional_field_id = @module.id
    @question.exam_group_id = @exam_group.id
    @question.is_pass = params[:is_pass].to_s
    if request.post? and @question.save