app/controllers/user_controller.rb

  def dashboard
    @user = current_user
    @config = Configuration.available_modules

    if @user.student?
      @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `students` WHERE (`students`.`admission_no` = '11') LIMIT 1

  def login
    @institute = Configuration.find_by_config_key("LogoName")
    available_login_authes = FedenaPlugin::AVAILABLE_MODULES.select{|m| m[:name].classify.constantize.respond_to?("login_hook")}
    selected_login_hook = available_login_authes.first if available_login_authes.count>=1
    if selected_login_hook
      authenticated_user = selected_login_hook[:name].classify.constantize.send("login_hook",self)
    else
      if request.post? and params[:user]
        @user = User.new(params[:user])
        user = User.find_by_username @user.username
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT * FROM `users` WHERE (`users`.`username` = '11') LIMIT 1